app/controllers/drones_controller.rb

  def index
    @drones = Drone.all
---
SELECT "drones".* FROM "drones"

  def create
    @drone = Drone.new(drone_params)

    respond_to do |format|
      if @drone.save
---
INSERT INTO "drones" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asd"], ["created_at", "2021-05-14 17:30:03.484924"], ["updated_at", "2021-05-14 17:30:03.484924"]]

  def destroy
    @drone.destroy
---
DELETE FROM "drones" WHERE "drones"."id" = $1  [["id", 2]]

  def take_off
    if @drone.update(status: 'hovering')
---
UPDATE "drones" SET "status" = $1, "updated_at" = $2 WHERE "drones"."id" = $3  [["status", 1], ["updated_at", "2021-05-14 18:56:52.524750"], ["id", 1]]

  def move
    if @drone.update(position: params[:position].to_s, status: 'moving')
---
UPDATE "drones" SET "status" = $1, "position" = $2, "updated_at" = $3 WHERE "drones"."id" = $4  [["status", 2], ["position", 3], ["updated_at", "2021-05-14 19:22:30.923414"], ["id", 1]]

  def land
    if @drone.update(status: 'off')
---
UPDATE "drones" SET "status" = $1, "updated_at" = $2 WHERE "drones"."id" = $3  [["status", 0], ["updated_at", "2021-05-14 19:11:03.822726"], ["id", 1]]

    def set_drone
      @drone = Drone.find(params[:id])
---
SELECT "drones".* FROM "drones" WHERE "drones"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]